// config files for bootlegger can have LINE comments BUT NOT additive comments:
// good: // comment
// bad: "mdn": "link", // link to MDN

// regular slashes in file paths are allowed and encouraged:
// C:/custom/pepega/pepega/mods

{
	// minimal requirement: path to the folder containing folders with modules.
	// The required structure is:
	// - root_folder
	// 		- module_name
	//		- module_name
	//		- module_name
	//			- file1.js
	//			- file2.js
	//			- file1.css
	//			- file2.css
	//		- module_name
	"jsmodules": "modules",

	// minimal requirement: function pool name (where to store all the functions)
	"sys_name": "kickboxer",

	"root_module_name": "",
	"override_sys_name": "kbmodules",

	// explicitly define the module order.
	// the specified modules are put in order and then unspecified modules are added
	// if module does not exist - ignore
	// only counts if points to a valid destination. Otherwise - ignore.
	"modules_order": [
		// "core"
		// "home"
	],

	// Path to the root folder containing modules folder, variables, fonts, etc
	// If not present, false, empty, null or invalid - each path field would require an absolute path
	// otherwise - hybrid: If absoulte, then use absolute, if relative then use relative
	"project": "C:/Users/kserh/github/kickboxer3000/app/src",

	// folder name with compiled modules
	// auto = use original modules folder name
	"writename": "modules_c",

	// This is ignored if writename is specified
	// If writename is not specified then this suffix is added 
	// to the name of the folder cotaining compiled modules
	// auto = the same as not specifying this parameter
	"writesuffix": "",

	// if this is set to true then it means that only onefile should be generated
	"onlyfile": false,

	// whether to include beautiful ascii shite or not
	// default to True
	"art": true,


	// do a little cleanup

	// 0: dont do anything
	// 1: collapse lines which start with //
	// 2: collapse empty lines
	// 3: comments and empty lines

	// this does not account for strings or anything
	// default to 0	
	// "collapse": 0,

	// it's possible to sync the processed stuff with a remote destination
	// bootlegger server has to be running on the other side
	// coming soon: raw TCP sync for better performance
	"sync": {}
}





